const menuData = [
    "ข้าวผัดกะเพราไก่", "ข้าวผัดกะเพราหมู", "ข้าวผัดกะเพราทะเล", "ข้าวผัดกะเพราหมูกรอบ", "ข้าวผัดกะเพราเนื้อ",
    "ข้าวผัดปู", "ข้าวผัดกุ้ง", "ข้าวผัดหมู", "ข้าวผัดไก่", "ข้าวผัดทะเล", "ข้าวมันไก่", "ข้าวมันไก่ทอด",
    "ข้าวหมูแดง", "ข้าวหมูกรอบ", "ข้าวขาหมู", "ข้าวคลุกกะปิ", "ข้าวผัดน้ำพริกกุ้งสด", "ข้าวผัดสับปะรด",
    "ข้าวผัดต้มยำกุ้ง", "ข้าวผัดอเมริกัน", "ข้าวอบสับปะรด", "ข้าวเหนียวหมูปิ้ง", "ข้าวเหนียวไก่ย่าง",
    "ข้าวแกงเขียวหวานไก่", "ข้าวแกงเขียวหวานหมู", "ข้าวซอยไก่", "ข้าวซอยหมู", "แกงเขียวหวานไก่",
    "แกงเขียวหวานหมู", "แกงเขียวหวานลูกชิ้นปลา", "แกงพะแนงหมู", "แกงพะแนงเนื้อ", "แกงเผ็ดเป็ดย่าง",
    "แกงส้มชะอมกุ้ง", "แกงส้มผักรวม", "แกงจืดเต้าหู้หมูสับ", "แกงเลียงกุ้งสด", "แกงมัสมั่นไก่", "แกงมัสมั่นเนื้อ",
    "แกงป่าไก่", "แกงป่าหมู", "ต้มยำกุ้ง", "ต้มยำไก่", "ต้มยำทะเล", "ต้มข่าไก่", "ต้มจืดมะระยัดไส้",
    "ต้มโคล้งปลากรอบ", "ผัดไทยกุ้งสด", "ผัดไทยไก่", "ผัดไทยหมู", "ผัดซีอิ๊วหมู", "ผัดซีอิ๊วไก่",
    "ผัดซีอิ๊วทะเล", "ผัดขี้เมาหมู", "ผัดขี้เมาไก่", "ผัดขี้เมาทะเล", "ผัดผงกะหรี่ปู", "ผัดผงกะหรี่กุ้ง",
    "ผัดเผ็ดปลาดุก", "ผัดกระเพราหมูกรอบ", "ผัดกระเพรากุ้ง", "ผัดกระเพราเนื้อ", "ผัดกระเพราทะเล",
    "ผัดเปรี้ยวหวานไก่", "ผัดเปรี้ยวหวานหมู", "ผัดเปรี้ยวหวานกุ้ง", "ไข่เจียวหมูสับ", "ไข่เจียวกุ้งสับ",
    "ไข่ลูกเขย", "ปลาทอดน้ำปลา", "ปลาราดพริก", "หมูปิ้ง", "ไก่ย่าง", "หมูสะเต๊ะ", "เนื้อย่างจิ้มแจ่ว",
    "กุ้งเผาน้ำจิ้มซีฟู้ด", "ปลาหมึกย่าง", "ก๋วยเตี๋ยวเรือหมู", "ก๋วยเตี๋ยวเรือเนื้อ", "ก๋วยเตี๋ยวต้มยำกุ้ง",
    "ก๋วยเตี๋ยวต้มยำหมู", "ก๋วยเตี๋ยวต้มยำทะเล", "ก๋วยเตี๋ยวไก่มะระ", "บะหมี่หมูแดง", "บะหมี่เกี๊ยวกุ้ง",
    "ราดหน้าหมู", "ราดหน้าไก่", "ราดหน้าทะเล", "เย็นตาโฟ", "ขนมจีนน้ำยา", "ขนมจีนน้ำยาป่า",
    "ขนมจีนแกงเขียวหวานไก่", "ขนมจีนซาวน้ำ", "ส้มตำไทย", "ส้มตำปูปลาร้า", "ยำวุ้นเส้นหมูสับ", "ยำวุ้นเส้นทะเล",
    "ยำไข่ดาว", "ลาบหมู", "ลาบไก่", "ลาบเนื้อ", "น้ำตกหมู", "น้ำตกเนื้อ", "พล่ากุ้ง", "เบอร์เกอร์", "ไก่ทอด",
    "พิซซ่า", "ฮอทด็อก", "เฟรนช์ฟรายส์", "ข้าวเหนียวมะม่วง", "ข้าวเหนียวทุเรียน", "ขนมตาล", "ทับทิมกรอบ",
    "สังขยาฟักทอง", "กล้วยบวชชี", "บัวลอยไข่หวาน", "ลูกชุบ", "ตะโก้", "ขนมชั้น", "ชาไทย", "ชาเย็น",
    "กาแฟโบราณ", "น้ำมะตูม", "น้ำกระเจี๊ยบ", "น้ำอัญชันมะนาว", "น้ำลำไย"
];

function randomizeMenu() {
    const randomIndex = Math.floor(Math.random() * menuData.length);
    const randomMeal = menuData[randomIndex];
    document.getElementById("randomMenu").textContent = randomMeal;
}
